label chapter1:
    scene dreamWithGirl
    Game "Главный герой Костя видит сон, где еле различимая фигура со светом говорит непонятные вещи, где он разбирает только фразу «Ты должен написать код»."
    ## add image
    scene clock with dissolve
    Game "*звенит будильник*"

    Kostya "Блин, проспал всё таки"
    Kostya "4 часа сна перед уником - не лучшая идея"

    ## add image
    scene black
    Game "*Костя надевает футболку, джинсы и бежит на автобус*"

    scene busIn
    Game "*В автобусе Костя встречает своего коллегу*"
    Dima "Здарова!! Тоже проспал?"
    Kostya "Ага, работал над нашей прогой до 4 утра. А ты чего?"
    Dima "Да, отмечали вчера запуск нашего квантового компа в лабе. Ты чего не пришёл, кстати?"
    Kostya "И без того дел хватает, я же так-то ещё учусь, помимо аспирантуры."
    Dima "Ну ладно, потом ещё отметим с тобой лично"
    play sound "sounds/busIn.mp3"
    Bus 'Остановка "профессорская"'
    Kostya "Ладно, побежали быстрее"

    ## add image
    scene black
    play sound steps
    Game "*Костя и его коллега идут в сторону радиофака*"
    
    scene labEnter 
    Game "*Костя и его коллега спускаются и попадают в одну из лабораторий, где стоит огромный квантовый комп. Перед входом в лабораторию висит табличка «Кафедра Метаинжинерии».*"

    stop sound
    Liza "О, Костя, ты чего вчера не пришел?"
    Kostya "И тебе привет, Лиз. Да учеба, работа, сама понимаешь."
    Liza "О, А ну ладно. Дима, привет!"
    Dima "Прив, Лиз. Что у нас сегодня по заданиям?"
    Liza "Нужно тестить дальше компьютер и код нужно дописать будет, а то уже дедлайны горят."
    Liza "Познакомьтесь, это наш новенький лаборант, он учится ещё на 3 курсе, но уже многое знает в метаинжинерии!"
    Dima "Прямо тебя узнаю в нём, Костян))"
    Kostya "Это точно... Как тебя зовут то? И на чём прогаешь?"
    Roma "На Q# прогаю. А ты, я так понял, Костя?"
    Kostya "Ага. Ну пошли поможешь мне, заодно покажу тебе что к чему."
    scene black with dissolve
    